nfce_xml.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap12:Header>
    <nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao">
      <cUF>51</cUF>
      <versaoDados>3.10</versaoDados>
    </nfeCabecMsg>
  </soap12:Header>
  <soap12:Body>
    <enviNFe versao="3.10" xmlns="http://www.portalfiscal.inf.br/nfe">
      <idLote>1</idLote>
      <indSinc>1</indSinc>
      <NFe xmlns="http://www.portalfiscal.inf.br/nfe">
        <infNFe Id="NFe51150501882109000162650010000000011064552496" versao="3.10">
          <ide>
            <cUF>51</cUF>
            <cNF>06455249</cNF>
            <natOp>Venda</natOp>
            <indPag>0</indPag>
            <mod>65</mod>
            <serie>1</serie>
            <nNF>1</nNF>
            <dhEmi>2015-05-05T12:20:03-03:00</dhEmi>
            <tpNF>1</tpNF>
            <idDest>1</idDest>
            <cMunFG>5103403</cMunFG>
            <tpImp>4</tpImp>
            <tpEmis>1</tpEmis>
            <cDV>6</cDV>
            <tpAmb>2</tpAmb>
            <finNFe>1</finNFe>
            <indFinal>1</indFinal>
            <indPres>1</indPres>
            <procEmi>0</procEmi>
            <verProc>1.0</verProc>
          </ide>
          <emit>
            <CNPJ>01882109000162</CNPJ>
            <xNome>COXIPO COM PROD PAPELARIA IMP EXPORTACAO LTDA EPP</xNome>
            <enderEmit>
              <xLgr>AVENIDA TENENTE-CORONEL DUARTE</xLgr>
              <nro>191</nro>
              <xBairro>CENTRO NORTE</xBairro>
              <cMun>5103403</cMun>
              <xMun>Cuiaba</xMun>
              <UF>AM</UF>
              <UF>MT</UF>
              <CEP>78005500</CEP>
              <cPais>1058</cPais>
              <xPais>Brasil</xPais>
              <fone>6533171500</fone>
            </enderEmit>
            <IE>130333573</IE>
            <CRT>3</CRT>
          </emit>
          <dest>
            <CNPJ>46248310000120</CNPJ>
            <xNome>NF-E EMITIDA EM AMBIENTE DE HOMOLOGACAO – SEM VALOR FISCAL</xNome>
            <enderDest>
              <xLgr>Rua Teste</xLgr>
              <nro>123</nro>
              <xBairro>Centro</xBairro>
              <cMun>1300102</cMun>
              <xMun>Anori</xMun>
              <UF>MT</UF>
              <CEP>44021042</CEP>
            </enderDest>
            <indIEDest>9</indIEDest>
          </dest>
          <det nItem="1">
            <prod>
              <cProd>1</cProd>
              <cEAN>7891000315507</cEAN>
              <xProd>produto qualquer</xProd>
              <NCM>00</NCM>
              <CFOP>5102</CFOP>
              <uCom>kg</uCom>
              <qCom>1.0000</qCom>
              <vUnCom>10.00</vUnCom>
              <vProd>10.00</vProd>
              <cEANTrib>7891000315507</cEANTrib>
              <uTrib>kg</uTrib>
              <qTrib>1.0000</qTrib>
              <vUnTrib>10.00</vUnTrib>
              <indTot>1</indTot>
            </prod>
            <imposto>
              <ICMS>
                <ICMS00>
                  <orig>0</orig>
                  <CST>00</CST>
                  <modBC>3</modBC>
                  <vBC>10.00</vBC>
                  <pICMS>17.00</pICMS>
                  <vICMS>1.70</vICMS>
                </ICMS00>
              </ICMS>
            </imposto>
          </det>
          <total>
            <ICMSTot>
              <vBC>10.00</vBC>
              <vICMS>1.70</vICMS>
              <vICMSDeson>0.00</vICMSDeson>
              <vBCST>0.00</vBCST>
              <vST>0.00</vST>
              <vProd>10.00</vProd>
              <vFrete>0.00</vFrete>
              <vSeg>0.00</vSeg>
              <vDesc>0.00</vDesc>
              <vII>0.00</vII>
              <vIPI>0.00</vIPI>
              <vPIS>0.00</vPIS>
              <vCOFINS>0.00</vCOFINS>
              <vOutro>0.00</vOutro>
              <vNF>10.00</vNF>
            </ICMSTot>
          </total>
          <transp>
            <modFrete>9</modFrete>
          </transp>
          <pag>
            <tPag>01</tPag>
            <vPag>10.00</vPag>
          </pag>
          <infAdic>
            <infCpl>Volte Sempre</infCpl>
          </infAdic>
        </infNFe>
      </NFe>
    </enviNFe>
  </soap12:Body>
</soap12:Envelope>